CoopsInChina/GrooveAndGrill/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# OTA safety net: if a newly-flashed image crashes/reboots before it calls
# esp_ota_mark_app_valid_cancel_rollback() (see main.c, called once the menu
# screen is up), the bootloader automatically reverts to the previous
# working slot next boot instead of crash-looping on bad firmware.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_APP_ROLLBACK_ENABLE=y

# Reproducible builds: strips the compile date/time from the embedded app
# description (that's the only non-deterministic input for a fixed commit +
# pinned toolchain), so `pio run` on the same commit reproduces the exact
# same firmware.bin bytes CI published — see "Verifying a release" in the
# README for how to check this.
CONFIG_APP_REPRODUCIBLE_BUILD=y
# CONFIG_APP_COMPILE_TIME_DATE is not set

# PSRAM (OPI 8MB)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=n
CONFIG_SPIRAM_USE_MALLOC=y
# 0 = all malloc() prefers PSRAM (internal stays free for DMA)
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
# Allow EXT_RAM_BSS_ATTR to place static arrays in PSRAM, freeing DRAM for task stacks
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# WiFi setup portal's DNS hijack redirects every domain to the device, so a
# phone's parallel connectivity-check probes can exhaust the default 10-socket
# ceiling (httpd alone claims up to 7 by default) — seen as permanent
# "error in accept (23)" spam that never recovers. See wifi_manager.c's
# lru_purge_enable for the other half of this fix.
CONFIG_LWIP_MAX_SOCKETS=14

# Cache — wider cache lines improve RGB DMA throughput
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# RGB panel + PSRAM framebuffer: self-heal a DMA/timing-generator drift.
# Any flash write (e.g. esp_ota_mark_app_valid_cancel_rollback() in main.c,
# called right after the first screen navigate — or any later NVS commit)
# disables the flash cache on both cores for its duration, which can stall
# the RGB LCD driver's PSRAM-framebuffer-to-bounce-buffer refill ISR
# mid-scan. Without this, the panel doesn't resync on its own afterwards —
# it keeps clocking out a torn/shifted frame indefinitely (this is what was
# hitting us at boot, right as ota_mark_app_valid_cancel_rollback() ran
# right after the first screen's navigate/fade). This restarts the DMA
# transfer at the next vsync whenever that happens, so a stall costs at
# most one bad frame instead of a persistent shift.
#
# NOT also enabling CONFIG_LCD_RGB_ISR_IRAM_SAFE (the other half of
# Espressif's usual pairing for this problem, which keeps the refill ISR
# itself resident in IRAM so it isn't affected by the cache-disable window
# in the first place): that requires every callback the ISR calls out to —
# here, esp_lvgl_port's on_vsync callback, lvgl_port_flush_rgb_vsync_ready_callback
# in the vendored managed_components/espressif__esp_lvgl_port — to also be
# IRAM-resident, which it currently isn't. Enabling IRAM_SAFE without also
# patching that callback risks the ISR jumping into flash-resident code
# during a cache-disabled window, which is a crash, not a cosmetic glitch —
# a strictly worse failure mode than what we're fixing. Worth revisiting
# (with that vendored callback patched to IRAM_ATTR) if RESTART_IN_VSYNC
# alone doesn't fully resolve it.
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y

# LVGL colour depth (must match RGB panel bits_per_pixel)
CONFIG_LV_COLOR_DEPTH_16=y

# LVGL's internal object/style memory pool. This is a static buffer in
# INTERNAL DRAM (separate from the general heap, so heap_caps_get_free_size()
# can't see it), which means it competes with FreeRTOS task stacks for DRAM.
# The default 32KB was too small — every screen ever visited eats into it
# permanently (screens are cached forever; see ui_screen_invalidate() in
# ui_common.c) and it exhausted (lv_obj_create() returns NULL, crash). But
# 128KB starved DRAM so the Sonos poll/cmd tasks failed to spawn. Measured
# worst-case usage across all 12 screens is ~50KB. Trimmed to 64KB to give the
# BLE controller its DRAM back (see BT section below) while keeping ~14KB of
# pool headroom. Longer term the fix is to free unused screens or move this
# pool to PSRAM.
CONFIG_LV_MEM_SIZE_KILOBYTES=64

# Enable Montserrat fonts used by the Music & Meat UI
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_30=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_12=y

# Complex drawing required for transform zoom (3× speed digit scaling)
CONFIG_LV_DRAW_COMPLEX=y
# PNG decoder for embedded icon images
CONFIG_LV_USE_PNG=y
# SJPG/TJpgDec: enables standard JPEG decode — required for album art
CONFIG_LV_USE_SJPG=y
# QR code widget for WiFi setup screen
CONFIG_LV_USE_QRCODE=y

# FreeRTOS tick rate — 1 kHz gives 1 ms resolution for LVGL timers
CONFIG_FREERTOS_HZ=1000
# Timer service task stack — default 2048 is too small when autodim calls lv_anim_start
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# Disable legacy I2C driver warning (we use the legacy driver for simplicity)
CONFIG_I2C_SUPPRESS_DEPRECATE_WARN=y
# Phones send long headers (User-Agent etc) — default 512 causes 431 errors
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# Console via UART0 (GPIO43=TX, GPIO44=RX) — reliable across ROM + app.
# Switch to USB_SERIAL_JTAG later when CAN bus needs GPIO43/44.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Main task stack — default 3584 is too small once UI + QR gen + Sonos init stack up
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# MBedTLS: use the default ESP-IDF heap allocator (PSRAM-aware) instead of the internal
# allocator so TLS I/O buffers land in PSRAM. Fixes MBEDTLS_ERR_SSL_ALLOC_FAILED (-0x7F00).
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y
# TLS 1.3 disabled: ESP-IDF 5.3.1 experimental client sends wrong Finished MAC →
# -0x7780 FATAL_ALERT_MESSAGE on any server that accepts the offer.
# All art CDNs (TuneIn, Spotify) work with TLS 1.2.

# ---- Bluetooth LE (BBQ Box receiver) ----
# NimBLE host. We only ever passive-scan the BBQ Box's connectionless
# advertisements, so OBSERVER is the role we use. CENTRAL is left ENABLED even
# though we never connect: NimBLE in this IDF (5.3.1) fails to compile in a pure
# observer-only build — ble_gap_host_check_status() calls ble_gap_adv_active_
# instance(), which is only declared when an advertising/central role is on
# (-Werror=implicit-function-declaration). CENTRAL costs a little host RAM but
# builds cleanly. No peripheral/broadcaster (we never advertise).
# Runs alongside WiFi — coexistence is handled by the IDF controller.
# NOTE: the BLE controller + host need internal DRAM; this build is already
# DRAM-tight (see LV_MEM_SIZE_KILOBYTES history). Classic BT memory is
# released at init. Watch free DRAM on first boot.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
# Direct wireless-probe mode holds up to 2 concurrent probe connections.
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2
# NimBLE host stack's dynamic allocations (connection/GATT state, scales with
# MAX_CONNECTIONS) → PSRAM instead of internal DRAM. Going from 1 to 2
# connections cost enough internal DRAM to starve the Sonos cmd_task again;
# this is the structural fix rather than shaving more buffers. Only the
# controller's own link-layer/DMA buffers (CONFIG_BT_CTRL_* below) must stay
# internal — those are unaffected by this setting.
# CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_INTERNAL is not set
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y

# Controller/host memory trims — this build is DRAM-tight and the BLE
# controller needs a contiguous internal-DRAM block at init. These keep it
# small enough to allocate alongside LVGL + WiFi + the Sonos tasks. (Also:
# bbq_ble_init() runs BEFORE the Sonos/art/weather tasks in main.c so the
# controller gets first claim on unfragmented DRAM — without that ordering,
# init fails with "BLE_INIT: Malloc failed".)
#
# Box mode uses one scan; direct-probe mode uses one scan + up to two probe
# connections, so MAX_ACT=3 covers the worst case. The controller's adv-report
# + scan-dedup buffers can stay small (we pass filter_duplicates=0).
CONFIG_BT_CTRL_BLE_MAX_ACT=3
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_NUM=16
CONFIG_BT_CTRL_SCAN_DUPL_CACHE_SIZE=16
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=6
CONFIG_BT_NIMBLE_WHITELIST_SIZE=4
